{
  "news": [
    {
      "id": "a932dc5a-87ca-41e4-9c4f-7a8eb03ca35c",
      "title": "Charles Spencer and Wife Karen Divorcing After 13 Years of Marriage",
      "content": "Charles Spencer is divorcing his wife Karen Spencer after nearly 13 years of marriage.\n\nThe 9th Earl Spencer and younger brother of the late Princess Diana announced the split to The Mail on Sunday on June 8.\n\n\"It is immensely sad,\" Charles, 60, told the outlet. \"I just want to devote myself to all my children, and to my grandchildren, and I wish Karen every happiness in the future.\"\n\nThe Mail on Sunday reported that Charles' relationship with the Countess of Spencer, 52, came to an end amid the writing of his memoir, A Very Private School. The former couple announced their split to the staff at Althorp House, Charles’ ancestral home, in April.\n\nThe Mail on Sunday also reports that Spencer is \"becoming close to\" Norwegian archaeologist Dr. Cat Jarman — who co-hosts the history podcast The Rabbit Hole Detectives with Spencer and the Rev. Richard Coles — and that they \"look very happy together but that it is early days.\"\n\n\nCharles and Karen, a social entrepreneur who is the founder and CEO of Whole Child International, married on June 18, 2011, at Althorp House just two months after Charles’ nephew Prince William and Kate Middleton’s royal wedding.\n\nThe historic English estate, where Charles and his sister Diana grew up, became Karen's residence upon their marriage.\n\nCharles and Karen share a 12-year-old daughter, Charlotte Diana, whose middle name pays tribute to Princess Diana.\n\n\n<p>CHRIS JACKSON/AFP/Getty</p> Charles Spencer and Karen Spencer attend the wedding of Prince Harry and Meghan Markle on May 19, 2018\nCHRIS JACKSON/AFP/Getty\n\nCharles Spencer and Karen Spencer attend the wedding of Prince Harry and Meghan Markle on May 19, 2018\nKaren also has two older daughters from her previous marriage to Hollywood producer Mark Gordon. Charles has four children with his first wife, Victoria Lockwood, and two children with his second wife, Caroline Freud.\n\nRelated: Charles Spencer Reveals Childhood Trauma in Heartbreaking Account of His Boarding School Experience (Exclusive)\n\nIn March, Charles opened up about his personal struggles in his memoir, revealing his traumatic experiences at boarding school and subsequent therapy journey. He reflected on his marriages and sought professional help to understand his relationship patterns.\n\n“When looking at the wreckage of my first and second marriages, I learned early in therapy that being sent away to boarding school at eight years of age meant that I had next to no understanding of intimacy,” he wrote.\n\n<p>Rich Polk/Getty</p> Charles Spencer, 9th Earl Spencer and Countess Karen Spencer at the Whole Child International's Inaugural Gala in Los Angeles hosted by The Earl and Countess Spencer at Regent Beverly Wilshire Hotel on October 26, 2017 in Beverly Hills, California.\nRich Polk/Getty\n\nCharles Spencer, 9th Earl Spencer and Countess Karen Spencer at the Whole Child International's Inaugural Gala in Los Angeles hosted by The Earl and Countess Spencer at Regent Beverly Wilshire Hotel on October 26, 2017 in Beverly Hills, California.More\nCan't get enough of PEOPLE's Royals coverage? Sign up for our free Royals newsletter to get the latest updates on Kate Middleton, Meghan Markle and more!\n\nSpeaking exclusively to PEOPLE, Charles opened up about having his wife's support during the process of writing his book.\n\n\"Karen has been supportive,\" he said. \"I think it was very challenging for her to have a husband going through what was essentially four and a half years of the most profound therapy with very difficult undertones to it. And she supported the idea of me doing it.\"\n\n\"I think she always hoped I would come out happier and healthier,\" he continued. \"And that seems to be the case very much. So, I'm grateful to have her standing by me while I went through this, what I now realize was an essential process.\"\n\nFor more People news, make sure to sign up for our newsletter!\n\nRead the original article on People.\n\n\nShow comments\n\n\nIn Other News\nEntertainment\nThe Today Show\nThe Today Show\nWho will replace Katy Perry on ‘American Idol’? Why this favorite is taking herself o…\nWho will replace Katy Perry on ‘American Idol’? Why this favorite is taking herself out of the running\nPeople\nPeople\nPrincess Diana's brother Charles Spencer and wife Karen divorcing after 13 years\nPrincess Diana's brother Charles Spencer and wife Karen divorcing after 13 years\nFinance\nThe Motley Fool\nThe Motley Fool\nNvidia may be an exciting stock, but Its 10-for-1 stock split is a nothing burger: Op…\nNvidia may be an exciting stock, but Its 10-for-1 stock split is a nothing burger: Opinion\nSmartAsset\nSmartAsset\nWhat would retirement look like at 55 with $2.5 million?\nWhat would retirement look like at 55 with $2.5 million?\nFood\nCheapism\nCheapism\nHere's what to order from the Five Guys secret menu\nHere's what to order from the Five Guys secret menu\nAllrecipes\nAllrecipes\nI asked 4 chefs to pick the best fast-food french fries: Their pick was unanimous and…\nI asked 4 chefs to pick the best fast-food french fries: Their pick was unanimous and shocking!\nLighter Side\nHuffPost\nHuffPost\nDog treks 4 miles, gets help for owner after truck plummets off road\nDog treks 4 miles, gets help for owner after truck plummets off road\nThe Today Show\nThe Today Show\n56 bucket list ideas to help you step out of your comfort zone\n56 bucket list ideas to help you step out of your comfort zone\nSports\nYahoo Sports\nYahoo Sports\nStanley Cup Finals: Bobrovsky stones McDavid, Oilers as Panthers take Game 1\nStanley Cup Finals: Bobrovsky stones McDavid, Oilers as Panthers take Game 1 \nYahoo Sports\nYahoo Sports\nRyan Garcia arrested for alleged felony vandalism at Beverly Hills hotel\nRyan Garcia arrested for alleged felony vandalism at Beverly Hills hotel\nWeather\nAccuWeather\nAccuWeather\nTropical activity may brew near Gulf of Mexico, Caribbean by mid-June\nTropical activity may brew near Gulf of Mexico, Caribbean by mid-June\nAccuWeather\nAccuWeather\nResurgence of heat to impact outdoor plans across the West\nResurgence of heat to impact outdoor plans across the West\n\n\n",
      "imgSrc": "https://s.yimg.com/ny/api/res/1.2/3YAYi8CddfNjbH5hl5U0ow--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyNDI7aD04Mjg-/https://media.zenfs.com/en/aol_people_articles_471/b82cc5656566854413b853469a95f2e8",
      "link": "https://www.aol.com/charles-spencer-wife-karen-divorcing-225225364.html",
      "date": 1717934598711
    },
    {
      "id": "a401b57b-8b38-49f3-b6d1-748d9b69f647",
      "title": "Here's What To Order From the Five Guys Secret Menu",
      "content": "Folks, just about every chain has secret menu items these days. Five Guys — the Washington, D.C.–born burger chain — is no exception. From grilled cheese customizations and hot dog variations, here are the Five Guys menu hacks that you need to know about.\n\n\n\nJust remember: Be nice to your Five Guys employees when attempting the Five Guys secret menu. Give them a break when they’re understaffed or in the middle of a lunch rush. You already know the vibes.\n\nburger bowl from Five Guys\nKristi M. / Yelp\nBurger Bowl\nTo call an aluminum Five Guys takeout container a bowl is a stretch, but if you’re cutting carbs, you can get your burger patty and all the fixings without the bun.\n\n\nThe Artery Annihilator\nOrder a bacon cheeseburger.\n\nAsk for a halved hot dog on top.\n\nWell-Done Fries\nThis is pretty self explanatory. Order some of those peanut oil-laden French fries and ask for them well-done.\n\n\n\nFor more secret menu guides, please sign up for our free newsletters.\n\n\n\nPatty Melt\nFive Guys has Texas toast-esque bread on standby, so order your burger on that, rather than the traditional bun. Voilà, instant patty melt.\n\n\nSloppy Joe\nWhile you cannot get an actual Sloppy Joe at Five Guys, there’s a decent way to simulate it. Allegedly, this tastes just like the real thing. A little bit of hot sauce works here, too.\n\nOrder a burger with no cheese.\n\nAdd grilled peppers and onions, ketchup, and barbecue sauce.\n\nThe Double-Double Dupe\nWhile you can attempt to recreate In-N-Out’s burger at Five Guys, I’d say you needn’t bother. Nobody can do what In-N-Out does. Nobody.\n\nOrder a cheeseburger and add an extra slice of American cheese.\n\nAdd lettuce, tomato, pickles, and grilled onions.\n\nMix ketchup, mayo, and relish together to create the special sauce.\n\nThrow some melted cheese onto some fries along with that sauce to recreate Animal Fries.\n\nRelated: 8 Burger King Menu Hacks To Try Right Now \n\nfive guys burger\nTim M. / Yelp\nPresidential Burger\nWhen President Obama stopped at Five Guys, this is what he got. \n\nOrder a cheeseburger with lettuce, tomato, jalapeño peppers, and mustard.\n\nChicago Dog\nThough Five Guys doesn’t have the crucial ingredients of sport peppers and celery salt, you can still hack your way to a Chicago-style hot dog. And with free toppings and Five Guys' menu prices, it's a steal under $5.\n\nOrder a hot dog with tomato, relish, green peppers, pickles, mustard, and Cajun seasoning.\n\nDouble Grilled Cheeseburger\nStart with any amount of beef patties you desire, and build your burger the way you like.\n\nThen, instead of buns, ask for two grilled cheese sandwiches.\n\nGo for a run.\n\nMore from Cheapism:\n\nCostco Prepared Meals That'll Feed Your Whole Family\n\nFabulous Fast-Food Freebies and Deals at Taco Bell, McDonald's, and More Popular Chains This Month\n\nThese Are the 7 Cheapest Fast-Food Joints To Try Right Now\n\nAre Rao's Frozen Pizzas Any Good? I Tasted Them All To Find Out\n\nThis article was originally published on Cheapism\n",
      "imgSrc": "https://s.yimg.com/ny/api/res/1.2/Pc.Xce0tL2S5KmLNtcTkrA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyNDI7aD0xMjQy/https://media.zenfs.com/en/aol_cheapism_430/c852619400674e1c7c912628e3fc110e",
      "link": "No link provided",
      "date": 1717934657942
    },
    {
      "id": "643e9964-32dd-4181-952a-e3ae4ddcaf0f",
      "title": "What You Didn't Know About Disney Theme Parks",
      "content": "36 Things You Probably Didn’t Know About Disney\nDisney parks are known to house many secrets to keep the park alive and magical. Here are 36 of my favorite things about the park.\n\naureliefrance / istockphoto\naureliefrance / istockphoto\n1. Cats Clean The Grounds\nWhen Disney first opened, feral cats would sneak onto the grounds and catch the mice that inhabited the parks. Instead of fighting the problem, Disney embraced it. During the day, up to 200 cats lounge around on their own special feeding stations. At night, the cats are let out to keep the grounds free of mice.\n\nAnd the cats are well cared for, too. Males and females are spayed and neutered, and any kittens that join the family are put up for adoption.\n\nMatt Walker / Flickr\nMatt Walker / Flickr\n2. The Manhole Covers In ToonTown Play Music\nJump on one and see what music it plays! Hint: the sounds correspond with the instruments on the fountain these covers surround.\n\nDepositPhotos.com\nDepositPhotos.com\n3. You Won’t See A Character Point Their Finger\nAt least not with a single finger, as it’s considered rude in some cultures. Most often, they gesture with two fingers or a sweeping hand.\n\nphilinnz4 / istockphoto\nphilinnz4 / istockphoto\n4. There Are Thousands Of Mickey Mouse Heads Hidden In The Park\nNext time you’re there, see how many you can find!\n\nManakin / istockphoto\nManakin / istockphoto\n5. There Is An Entire Network Of Underground Tunnels Beneath The Park\nThis not only helps keep characters from being in the wrong “land” (i.e. a Cowboy in Tomorrowland) but prevents guests from seeing two of the same characters (i.e. two Cinderellas) at once during a shift change.\n\nGeorge / Flickr\nGeorge / Flickr\n6. The Hitching Posts On Main Street Are Painted Every Night\nAnother small piece of evidence the attention to detail in the parks. Each night, the highly touched hitching posts are stripped and repainted so they look fresh the next morning for the next round of guests.\n\nIn fact, the starting time these posts are painted is based on the humidity and temperature to ensure they’re dry in the morning and no one gets sticky fingers.\n\nugajewel / Flickr\nugajewel / Flickr\n7. The Teacups Spin At Different Speeds\nDesigned to give a fun experience for all, pick an orange teacup with diamonds if you want to spin fast and pink one with hearts if you want to go slower.\n\nawl11 / Flickr\nawl11 / Flickr\n8. The Animal Kingdom Has Scientists\nThey study the animals and their behaviors. One one trip to Africa, they discovered a special call elephants make in relation to alerting each other about bees.\n\nEnchantedFairy / iStock\nEnchantedFairy / iStock\n9. The Castles Aren’t As Big As They Look\nThe stones near the bottom of the castles are larger than the stones at the top. This optical illusion gives observers the appearance that the castle is actually taller. This effect is also used on the Haunted Mansion and buildings on Main Street.\n\nBR WDW / Flickr\nBR WDW / Flickr\n10. The Haunted Mansion Has A Pet Cemetery\nIf you’re lucky and ask the right person, you may just get a private tour.\n\njohn koenig * / Flickr\njohn koenig * / Flickr\n11. Over 800 Species Of Plants Are Used To Create Authenticity\nFor example, at the Polynesian Hotel, Polynesian plants are used to create a true and authentic feel of being on the Polynesian Islands. At the Wilderness Lodge, moose tracks and large, native vegetation are used to create a cooler environment, like you’re out west.\n\nsmckenzie / istockphoto\nsmckenzie / istockphoto\n12. All The Costumes Are Hand Made\nHand stitching and fabrics relevant to a specific period in time is used to create authenticity. To add, gold thread is used on relevant costumes to create a special sparkle. This not only gives each character extra pride in what they’re wearing, but rings true that attention to detail is everything.\n\nScott Barlow / Flickr\nScott Barlow / Flickr\n13. You Can Drive The Mark Twain\nIf you’re polite and ask nicely, you may be able to drive the Mark Twain Steamboat. While it’s technically on rails, it’d still be fun to spin the wheel and ring the bell!\n\nPublic Domain\nPublic Domain\n14. The Plants In Tomorrowland Are Edible\nWalt believed the future would be self-sustaining, so each plant is edible.\n\nDepositPhotos.com\nDepositPhotos.com\n15. Cast Members Are Encouraged To Help\nWhether a guest is lost, needs a family photo or a child drops an ice cream cone, cast members are encouraged to help whenever and however possible to each guest has a wonderful and magical time at the park.\n\ntastemaven / Flickr\ntastemaven / Flickr\n16. There Is Always A Trash Can Within 30 Steps\nIt’s been said that Disney was disgusted over how dirty theme parks and festivals were. He made a point to watch how far people carried trash before dropping it. The magical number? 30 steps.\n\n\nMatthew Cooper / Flickr\nMatthew Cooper / Flickr\n17. The Ground Is Painted To Enhance Photos\nKodak did a study with Disney and painted the ground to make each photo appear more vivid.\n\nadameq2 / DepositPhotos\nadameq2 / DepositPhotos\n18. Walt Disney Created Fictitious Companies To Purchase Disney World\nWhy? To help disguise the intent of his grandiose plans. Today, you can find the names of these fictitious companies, like Tomahawk Properties, Compass East Corporation and Bay Lake Properties, throughout the park – cleverly disguised as store and shop names.\n\ncholprapha / iStock\ncholprapha / iStock\n19. There’s A Secret Police\nDressed in common civilian clothes, these sneaky officers monitor the safety and well-being of park-goers without disturbing the magic.\n\nJames Palmer / Flickr\nJames Palmer / Flickr\n20. The Tree Of Life Is Actually An Oil Rig\nDesigners and engineers determined an oil rig was one of the strongest structures and thus used it for this attraction.\n\nAneese / iStock\nAneese / iStock\n21. Staff Can Play Basketball In The Matterhorn\nYes, there’s a secret basketball court on the third level- how cool is that?\n\nRussell102 / iStock\nRussell102 / iStock\n22. People Have Tried To Spread Deceased Family Members’ Ashes In The Park\nFor the record, this has and never will be allowed at Disney. Yet it still hasn’t stopped people from trying.\n\nJoe Penniston / Flickr\nJoe Penniston / Flickr\n23. In The “Hall Of Presidents” Bill Clinton Is Wearing His Favorite Iron Man Watch\nIf you look closely, the time is correct too.\n\nRick Vink / Flickr\nRick Vink / Flickr\n24. Fourteen Of The Original Attractions Are Still In Use Today\nIt’s a Small World\nDumbo the Flying Elephant\nFrontierland Shootin’ Arcade\nThe Hall of Presidents\nMad Tea Party\nPeter Pan’s Flight\nPrince Charming Regal Carrousel\nSwiss Family Treehouse\nJungle Cruise\nCountry Bear Jamboree\nWalt Disney World Railroad\nThe Haunted Mansion\nWalt Disney’s Enchanted Tiki Room\nTomorrowland Speedway\nChris Dikos / Flickr\nChris Dikos / Flickr\n25. Cinderella’s Castle Has A Secret Suite, And It Cannot Be Booked\nOriginally intended to be an apartment for Walt Disney, it’s now only used for special promotions and giveaways, so don’t expect to be able to book it for a night while staying at the resort.\n\nMark Walter/ Flickr\nMark Walter/ Flickr\n26. None Of The Disney Shops Sell Gum\nThis is another way to help keep the park clean and free of gum being stuck to its masterful pieces, streets, and rides.\n\nRK*Pictures / Flickr\nRK*Pictures / Flickr\n27. Smellitizers Are Scattered Throughout The Resort\nNext time you’re at the Pirates of the Caribbean attraction, you’ll notice a faint, yet obvious smell of salty air. On Main Street, you may smell baking cookies or vanilla.\n\nMickey Views / Flickr\nMickey Views / Flickr\n28. The Brown Concrete Path Reflects Sewage During That Time Period\nHmmm tasty, right? Thankfully, I don’t believe they use smellitizers here…\n\nEat My Disney Dust / Flickr\nEat My Disney Dust / Flickr\n29. Main Street Has Over 100,000 Light Bulbs\nTalk about a huge electric bill – for one street alone!\n\nJodi Renshaw / Flickr\nJodi Renshaw / Flickr\n30. The Cast Cannot Grow Facial Hair\nUnless a mustache or beard is fully grown before being hired or grown while away on vacation, men cannot have stubble or facial hair.\n\nJustin Barton / Flickr\nJustin Barton / Flickr\n31. There’s A Secret Speakeasy\nThere’s only two places an adult can get a cocktail: one is the Little Mermaid-themed restaurant, and the other is a super secret speakeasy, Club 33. But don’t expect to bop in there for a quick drink – there’s a ten year waiting list. Open since 1967, the club costs $10,000 a year and has a $25,000 initiation fee per person.\n\nDisney Dan / Flickr\nDisney Dan / Flickr\n32. The Characters’ Moods Change Throughout The Day\nThey’re more perky and peppy in the morning and more mellow in the evening to match the moods of their guests.\n\nMichaelGordon1 / iStock\nMichaelGordon1 / iStock\n33. Steve Martin Worked At DisneyLand\nAs a child, he sold guidebooks then later advanced to working at the Magic Shop.\n\nDavid Bjorgen / Wikimedia Commons\nDavid Bjorgen / Wikimedia Commons\n34. Real Skeletons Were Used In The Pirates Of The Caribbean Attraction\nWhen first opened to the public, fake skeletons look well, rather fake. Replacements were ordered, all issues from a medical institute that had been used for study. According to Buzzfeed, there’s still a real skull there today.\n\nRon Thorp / Flickr\nRon Thorp / Flickr\n35. Disney Has A Huge Staff\nThere are approximately 28,000 cast members that work at Disneyland.\n\nCourtesy Disney’s Art of Animation Resort\nCourtesy Disney’s Art of Animation Resort\n36. There’s A Disney Podcast\nFans can stay up to date with the current news, events, and activities via By The Numb3rs.\n\nThis article originally appeared on SimpleMost and was syndicated by MediaFeed.\n\nRetirement Vacation Concept, Happy Mature Retired Couple Enjoying Beautiful Sunset at the Beach\nEpicStockMedia/istockphoto\nMore from MediaFeed\nUS Cities That Make Retirement Feel Like Vacation\nOnly a True Boomer Could Name These Forgotten '70s Actors\n\nHow Many of These Songs From the '70s Can You Name From Just the First Line?\n\n\nShow comments\n\n\n\n\n\nResults: Here's who won TCPalm's poll for best ice cream parlor on the Treasure Coast\nGannett\nSTAFF REPORT\nJune 9, 2024 at 12:00 PM\nWhat's your favorite ice cream shop on the Treasure Coast? Here's the results of our poll:\n\n\nThis article originally appeared on Treasure Coast Newspapers: Poll results: Best ice cream in PSL, Stuart, Vero Beach, Fort Pierce",
      "imgSrc": "https://s.yimg.com/ny/api/res/1.2/tPUT9kGGufSVMXRScD0EFg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyNDI7aD01Nzc-/https://media.zenfs.com/en/aol_mediafeed_842/ce735ea9935f25e9529e8ad1eb181069",
      "link": "No link provided",
      "date": 1717934718425
    }
  ]
}