export const MockApiData = [
  {
    key: 1,
    date: 1716741521235,
    title:
      'Ученые выяснили что Леха Гей',
    link: 'https://nv.ua/ukr/world/geopolitics/zelenskiy-rosiya-zbiraye-nove-ugrupovannya-viysk-za-90-km-vid-harkova-novini-ukrajini-50421854.html',
    imgSrc:
      'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTSwvFFo19LICp-p1qGCU783scoJWIGgUUDpDx-asP1vQ&s',
    content:
      'Исследования показали что Леха гей, буквально зараз, цими днями, ми захищаємось за 60 кілометрів на північний схід від цього місця від чергової спроби російського наступу. Росія готується до спроби наступальних дій, і за 90 кілометрів звідси на північний захід біля нашого кордону збирається ще одне угруповання військ», — розповів президент.',
  },
  {
    key: 2,
    date: 1716741521235,
    title:
      'Росія збирає нове угруповання військ біля кордону за 90 км від Харкова — Зеленський',
    link: 'https://nv.ua/ukr/world/geopolitics/zelenskiy-rosiya-zbiraye-nove-ugrupovannya-viysk-za-90-km-vid-harkova-novini-ukrajini-50421854.html',
    imgSrc:
      'https://static.nv.ua/shared/system/Article/posters/002/891/427/original/a59181d8d1f3137daef9c302156dba5e.jpg?q=85&stamp=20240526110835&w=900&f=webp',
    content:
      '«Саме Росія є єдиним джерелом агресії і постійно намагається розширити війну. Буквально зараз, цими днями, ми захищаємось за 60 кілометрів на північний схід від цього місця від чергової спроби російського наступу. Росія готується до спроби наступальних дій, і за 90 кілометрів звідси на північний захід біля нашого кордону збирається ще одне угруповання військ», — розповів президент.',
  },
  {
    key: 3,
    date: 1716741521235,
    title:
      'Росія збирає нове угруповання військ біля кордону за 90 км від Харкова — Зеленський',
    link: 'https://nv.ua/ukr/world/geopolitics/zelenskiy-rosiya-zbiraye-nove-ugrupovannya-viysk-za-90-km-vid-harkova-novini-ukrajini-50421854.html',
    imgSrc:
      'https://static.nv.ua/shared/system/Article/posters/002/891/427/original/a59181d8d1f3137daef9c302156dba5e.jpg?q=85&stamp=20240526110835&w=900&f=webp',
    content:
      '«Саме Росія є єдиним джерелом агресії і постійно намагається розширити війну. Буквально зараз, цими днями, ми захищаємось за 60 кілометрів на північний схід від цього місця від чергової спроби російського наступу. Росія готується до спроби наступальних дій, і за 90 кілометрів звідси на північний захід біля нашого кордону збирається ще одне угруповання військ», — розповів президент.',
  },
  {
    key: 4,
    date: 1716741521235,
    title:
        'Росія збирає нове угруповання військ біля кордону за 90 км від Харкова — Зеленський',
    link: 'https://nv.ua/ukr/world/geopolitics/zelenskiy-rosiya-zbiraye-nove-ugrupovannya-viysk-za-90-km-vid-harkova-novini-ukrajini-50421854.html',
    imgSrc:
        'https://static.nv.ua/shared/system/Article/posters/002/891/427/original/a59181d8d1f3137daef9c302156dba5e.jpg?q=85&stamp=20240526110835&w=900&f=webp',
    content:
        '«Саме Росія є єдиним джерелом агресії і постійно намагається розширити війну. Буквально зараз, цими днями, ми захищаємось за 60 кілометрів на північний схід від цього місця від чергової спроби російського наступу. Росія готується до спроби наступальних дій, і за 90 кілометрів звідси на північний захід біля нашого кордону збирається ще одне угруповання військ», — розповів президент.',
  },
];
